In [2]:
import pandas as pd

In [4]:
friend_dict_list = [
    {'name' : 'john', 'age': 25, 'job': 'student'},
    {'name' : 'john', 'age': 25, 'job': 'student'}
]

In [6]:
df = pd.DataFrame(friend_dict_list)

In [8]:
df.head()

   name  age      job
0  john   25  student
1  john   25  student

In [13]:
df = df[['name', 'age', 'job']]

In [14]:
df

   name  age      job
0  john   25  student
1  john   25  student

In [18]:
from collections import OrderedDict

In [20]:
friend_ordered_dict = OrderedDict(
    [
        ('name', ['john', 'nate']),
        ('age', [25, 30]),
        ('job', ['student', 'teacher'])
    ]
)

In [22]:
df = pd.DataFrame.from_dict(friend_ordered_dict)

In [24]:
df.head()

   name  age      job
0  john   25  student
1  nate   30  teacher

In [26]:
friend_list = [
    ['john', 20, 'student'],
    ['nate', 30, 'teacher']
]

In [32]:
column_name = ['name', 'age', 'job']

In [33]:
df = pd.DataFrame.from_records(friend_list)

In [34]:
df.head()

      0   1        2
0  john  20  student
1  nate  30  teacher

In [35]:
friend_list = [
    ['name', ['john', 'nate']],
    ['age', [20, 30]],
    ['job', ['student', 'teacher']]
]

In [37]:
df = pd.DataFrame.from_items(friend_list)

AttributeError: type object 'DataFrame' has no attribute 'from_items'

In [38]:
df.head()

      0   1        2
0  john  20  student
1  nate  30  teacher